<%@ page language="java" contentType="text/html; charset=UTF-8" pageEncoding="UTF-8"%>
<%@include file="/header.jsp" %>

<style>
	.agree-text-box{
		height: 300px;
		width:100%;
		overflow: auto;
		word-break: keep-all;
		padding: 10px;
	}
</style>
<script type="text/javascript" src="${path}/js/login.js"></script>
<div>
	<div class="agree-header my-5 text-center">
		<h2 class="fw-bold">회원가입</h2>
		<h5>PET CARE는 여러분을 환영합니다.</h5>
	</div>
	<div class="agree-div1 my-4">
		<div class="agree-title my-2">
			<h4>✅ PET CARE 이용약관</h4>
		</div>
		<div class="agree-text-div my-2">
			<div class="agree-text-box card">
				<p>국군은 국가의 안전보장과 국토방위의 신성한 의무를 수행함을 사명으로 하며, 그 정치적 중립성은 준수된다. 정당의 목적이나 활동이 민주적 기본질서에 위배될 때에는 정부는 헌법재판소에 그 해산을 제소할 수 있고,
					정당은 헌법재판소의 심판에 의하여 해산된다. 대법관의 임기는 6년으로 하며, 법률이 정하는 바에 의하여 연임할 수 있다. 국회는 헌법 또는 법률에 특별한 규정이 없는 한 재적의원 과반수의 출석과 출석의원
					과반수의 찬성으로 의결한다. 가부동수인 때에는 부결된 것으로 본다. 언론·출판은 타인의 명예나 권리 또는 공중도덕이나 사회윤리를 침해하여서는 아니된다. 언론·출판이 타인의 명예나 권리를 침해한 때에는 피해자는
					이에 대한 피해의 배상을 청구할 수 있다.</p>
				
				<p>재판의 전심절차로서 행정심판을 할 수 있다. 행정심판의 절차는 법률로 정하되, 사법절차가 준용되어야 한다. 국가안전보장회의는 대통령이 주재한다. 이 헌법에 의한 최초의 대통령의 임기는 이 헌법시행일로부터
					개시한다. 국무회의는 대통령·국무총리와 15인 이상 30인 이하의 국무위원으로 구성한다. 대법원에 대법관을 둔다. 다만, 법률이 정하는 바에 의하여 대법관이 아닌 법관을 둘 수 있다. 정부는 회계연도마다
					예산안을 편성하여 회계연도 개시 90일전까지 국회에 제출하고, 국회는 회계연도 개시 30일전까지 이를 의결하여야 한다. 국가의 세입·세출의 결산, 국가 및 법률이 정한 단체의 회계검사와 행정기관 및 공무원의
					직무에 관한 감찰을 하기 위하여 대통령 소속하에 감사원을 둔다.</p>
				
				<p>재의의 요구가 있을 때에는 국회는 재의에 붙이고, 재적의원과반수의 출석과 출석의원 3분의 2 이상의 찬성으로 전과 같은 의결을 하면 그 법률안은 법률로서 확정된다. 각급 선거관리위원회는 선거인명부의 작성등
					선거사무와 국민투표사무에 관하여 관계 행정기관에 필요한 지시를 할 수 있다. 대통령은 국무총리·국무위원·행정각부의 장 기타 법률이 정하는 공사의 직을 겸할 수 없다. 원장은 국회의 동의를 얻어 대통령이
					임명하고, 그 임기는 4년으로 하며, 1차에 한하여 중임할 수 있다. 법률이 헌법에 위반되는 여부가 재판의 전제가 된 경우에는 법원은 헌법재판소에 제청하여 그 심판에 의하여 재판한다.</p>
				
				<p>국회의원의 선거구와 비례대표제 기타 선거에 관한 사항은 법률로 정한다. 대통령은 제4항과 제5항의 규정에 의하여 확정된 법률을 지체없이 공포하여야 한다. 제5항에 의하여 법률이 확정된 후 또는 제4항에 의한
					확정법률이 정부에 이송된 후 5일 이내에 대통령이 공포하지 아니할 때에는 국회의장이 이를 공포한다. 국회는 상호원조 또는 안전보장에 관한 조약, 중요한 국제조직에 관한 조약, 우호통상항해조약, 주권의 제약에
					관한 조약, 강화조약, 국가나 국민에게 중대한 재정적 부담을 지우는 조약 또는 입법사항에 관한 조약의 체결·비준에 대한 동의권을 가진다. 공공필요에 의한 재산권의 수용·사용 또는 제한 및 그에 대한 보상은
					법률로써 하되, 정당한 보상을 지급하여야 한다.</p>
				
				<p>법원은 최고법원인 대법원과 각급법원으로 조직된다. 국가는 청원에 대하여 심사할 의무를 진다. 대통령후보자가 1인일 때에는 그 득표수가 선거권자 총수의 3분의 1 이상이 아니면 대통령으로 당선될 수 없다.
					대통령이 임시회의 집회를 요구할 때에는 기간과 집회요구의 이유를 명시하여야 한다. 국가는 과학기술의 혁신과 정보 및 인력의 개발을 통하여 국민경제의 발전에 노력하여야 한다. 모든 국민은 법 앞에 평등하다.
					누구든지 성별·종교 또는 사회적 신분에 의하여 정치적·경제적·사회적·문화적 생활의 모든 영역에 있어서 차별을 받지 아니한다. 국가는 평생교육을 진흥하여야 한다. 국가는 농수산물의 수급균형과 유통구조의 개선에
					노력하여 가격안정을 도모함으로써 농·어민의 이익을 보호한다.</p>
			</div>
		</div>
		<div class="agree-chk-div my-2">
			<input class="form-check-input agree-chk" type="checkbox" id="agree1">
			<label class="form-check-label" for="agree1">PET CARE 이용약관 동의</label>
		</div>
	</div>
	<div class="agree-div2 my-4">
		<div class="agree-title my-2">
			<h4>✅ 개인정보 수집 및 이용</h4>
		</div>
		<div class="agree-text-div my-2">
			<div class="agree-text-box card">
				<p>법관이 중대한 심신상의 장해로 직무를 수행할 수 없을 때에는 법률이 정하는 바에 의하여 퇴직하게 할 수 있다. 피고인의 자백이 고문·폭행·협박·구속의 부당한 장기화 또는 기망 기타의 방법에 의하여 자의로 진술된
					것이 아니라고 인정될 때 또는 정식재판에 있어서 피고인의 자백이 그에게 불리한 유일한 증거일 때에는 이를 유죄의 증거로 삼거나 이를 이유로 처벌할 수 없다. 모든 국민은 신속한 재판을 받을 권리를 가진다.
					형사피고인은 상당한 이유가 없는 한 지체없이 공개재판을 받을 권리를 가진다. 법관은 탄핵 또는 금고 이상의 형의 선고에 의하지 아니하고는 파면되지 아니하며, 징계처분에 의하지 아니하고는 정직·감봉 기타 불리한
					처분을 받지 아니한다.</p>
				
				<p>국가는 주택개발정책등을 통하여 모든 국민이 쾌적한 주거생활을 할 수 있도록 노력하여야 한다. 국가는 청원에 대하여 심사할 의무를 진다. 체포·구속·압수 또는 수색을 할 때에는 적법한 절차에 따라 검사의 신청에
					의하여 법관이 발부한 영장을 제시하여야 한다. 다만, 현행범인인 경우와 장기 3년 이상의 형에 해당하는 죄를 범하고 도피 또는 증거인멸의 염려가 있을 때에는 사후에 영장을 청구할 수 있다. 국가안전보장에
					관련되는 대외정책·군사정책과 국내정책의 수립에 관하여 국무회의의 심의에 앞서 대통령의 자문에 응하기 위하여 국가안전보장회의를 둔다. 국정감사 및 조사에 관한 절차 기타 필요한 사항은 법률로 정한다.</p>
				
				<p>누구든지 병역의무의 이행으로 인하여 불이익한 처우를 받지 아니한다. 학교교육 및 평생교육을 포함한 교육제도와 그 운영, 교육재정 및 교원의 지위에 관한 기본적인 사항은 법률로 정한다. 헌법재판소 재판관의 임기는
					6년으로 하며, 법률이 정하는 바에 의하여 연임할 수 있다. 대통령은 법률안의 일부에 대하여 또는 법률안을 수정하여 재의를 요구할 수 없다. 국채를 모집하거나 예산외에 국가의 부담이 될 계약을 체결하려 할
					때에는 정부는 미리 국회의 의결을 얻어야 한다. 대통령·국무총리·국무위원·행정각부의 장·헌법재판소 재판관·법관·중앙선거관리위원회 위원·감사원장·감사위원 기타 법률이 정한 공무원이 그 직무집행에 있어서 헌법이나
					법률을 위배한 때에는 국회는 탄핵의 소추를 의결할 수 있다.</p>
				
				<p>국가는 재해를 예방하고 그 위험으로부터 국민을 보호하기 위하여 노력하여야 한다. 탄핵결정은 공직으로부터 파면함에 그친다. 그러나, 이에 의하여 민사상이나 형사상의 책임이 면제되지는 아니한다. 국민경제의 발전을
					위한 중요정책의 수립에 관하여 대통령의 자문에 응하기 위하여 국민경제자문회의를 둘 수 있다. 국회의 정기회는 법률이 정하는 바에 의하여 매년 1회 집회되며, 국회의 임시회는 대통령 또는 국회재적의원 4분의 1
					이상의 요구에 의하여 집회된다. 국회에서 의결된 법률안은 정부에 이송되어 15일 이내에 대통령이 공포한다. 국가는 법률이 정하는 바에 의하여 재외국민을 보호할 의무를 진다.</p>
				
				<p>예비비는 총액으로 국회의 의결을 얻어야 한다. 예비비의 지출은 차기국회의 승인을 얻어야 한다. 타인의 범죄행위로 인하여 생명·신체에 대한 피해를 받은 국민은 법률이 정하는 바에 의하여 국가로부터 구조를 받을 수
					있다. 모든 국민은 직업선택의 자유를 가진다. 헌법재판소는 법관의 자격을 가진 9인의 재판관으로 구성하며, 재판관은 대통령이 임명한다. 국회의원은 국회에서 직무상 행한 발언과 표결에 관하여 국회외에서 책임을
					지지 아니한다. 대법관은 대법원장의 제청으로 국회의 동의를 얻어 대통령이 임명한다. 선거와 국민투표의 공정한 관리 및 정당에 관한 사무를 처리하기 위하여 선거관리위원회를 둔다.</p>
			</div>
		</div>
		<div class="agree-chk-div my-2">
			<input class="form-check-input agree-chk" type="checkbox" id="agree2">
			<label class="form-check-label" for="agree2">개인정보 수집 및 이용 동의</label>
		</div>
	</div>
	<div class="agree-btns my-5">
		<input type="button" value="취소" class="btn btn-secondary mx-1" onclick="history.back(-1)">
		<input type="button" value="확인" class="btn btn-primary mx-1" onclick="agree.allchk()">
	</div>
</div>

<%@include file="/footer.jsp" %>